app/controllers/eu_rels_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
  def create
    @event = Event.find(params[:eu_rel][:attended_id])