app/controllers/events_controller.rb

INSERT INTO "events" ("comment", "created_at", "points", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@event = Event.new(event_params)
		if @event.save

SELECT  "events".* FROM "events"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events"
---
	def index
  	@events = Event.paginate(page: params[:page])

SELECT  "events".* FROM "events"  WHERE "events"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
   def show
  	@event = Event.find(params[:id])

SELECT  "events".* FROM "events"  WHERE "events"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
  def attenders
    @title = "Attenders"
    @event = Event.find(params[:id])

SELECT  "events".* FROM "events"  WHERE "events"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
UPDATE "events" SET "checkincode" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["checkincode", "Ws9vf4u8CNVRqQXzE_KbNA"], ["updated_at", "2014-10-22 11:32:47.980737"]]
---
  def update
  	@event = Event.find(params[:id])
  	@event.update_attribute(:checkincode, SecureRandom.urlsafe_base64)