app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@events = @user.events.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "events".* FROM "events"  WHERE "events"."user_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "events"  WHERE "events"."user_id" = ?  [["user_id", 1]]